Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: ཤ་ར་དྭ་ཏི འི་ བུ་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ནི་ ཡོངས་སུ་ བརྟག་པ་ བཟུང་ ན་ འདི་ལྟ་སྟེ །_ |#| དཔེར་ན་ རྒྱ་ མཚོ་ ཆེན་པོ་ དཔག་ཚད་ བརྒྱད་ ཁྲི་ བཞི་ སྟོང་ དང་ ལྡན་པ་ བཞིན་ དུ་ འཕང་ དུའང་ དེ་ཙམ་ དུ་ གྱུར་ ལ །_
en: Śāradvatī­putra, now imagine that this trichiliocosm becomes like the ocean, eighty-four thousand leagues deep and wide.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ནས་ སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ ཡུངས་འབྲུ ས་ གང་བ ར་ གྱུར་ ཏེ |#| དེ་ ལ་ སྟོབས་ དང་ ལྡན་ ཞིང་ མཐུ་ དང་ བརྩོན་འགྲུས་ ཐོབ་པ འི་ མི་ལ་ ལ་ ཞིག་ བྱུང་ ལ །_
en: Imagine then, Śāradvatī­putra, that the thousandfold universe is filled up with sesame seeds, and that some strong, powerful, and diligent person comes by.

source: དེས་ ཡུངས་འབྲུ འི་ ཕུང་པོ་ ཆེན་པོ་ དེ་ལས་ སྤར་གང་ བླངས་ ནས་ |#| ཕྱོགས་ བཞི ར་ གཏོར་ ཏེ
en: This person takes up the sesame seeds by the handful and tosses them in the four directions.

source: དེ་ཡང་ རླུང་ གིས་ མངོན་པར་ དེད་ ལ །_
en: As the seeds are carried by the wind,

source: གང་ ཡུངས་འབྲུ་ རེ་རེ་ ནས་ བླངས་ ཏེ་ འཇིག་རྟེན་ གྱི་ ཁམས་ རེ་རེ ར་ འཕངས་ ན །_
en: each one of them produces an entire universe.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ འདི་ ཇི་སྙམ་ དུ་ སེམས །_
en: Śāradvatī­putra, what do you think?

source: ཡུངས་ ཀར་ གྱི་ འབྲུ་ རེ་རེ ས་ བཟུང་བ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ཇི་སྙེད་ དུ་ འགྱུར །_
en: As they thus appear from each sesame seed, how many universes are there?”

source: བཅོམ་ལྡན་འདས་ ལ་ ཚེ་ དང་ ལྡན་པ་ ཤ་ར་དྭ་ཏི འི་ བུས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: replied Śāradvatī­putra,

source: བཅོམ་ལྡན་འདས་ དཔག་ ཏུ་ མ་ མཆིས་ ལགས་སོ །_།
en: $181 “Blessed One,” |#| “there are innumerable universes.

source: བདེ་བ ར་ གཤེགས་པ་ དཔག་ ཏུ་ མ་ མཆིས་ ལགས་སོ །_།
en: Blissful One, there are universes beyond count.”

source: བཀའ་ སྩལ་པ །_
en: said the Blessed One,

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ མོས་པ ར་ བྱ །_ |#| ཁོང་ དུ་ ཆུད་པ ར་ བྱ་ སྟེ །_
en: $182 “Śāradvatī­putra,” |#| “try to imagine and understand this.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཡུངས་འབྲུ ས་ ཡོངས་སུ་ ཟིན་པ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཇི་སྙེད་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ གྲོང་ཁྱེར་ ཆེན་པོ་ གཅིག་ ཏུ་ གྱུར་ ལ །_
en: Let us say that all these universes that arose from the sesame seeds were to turn into a single city.

source: གྲོང་ཁྱེར་ ཆེན་པོ་ དེ འི་ ཆུ་ཞེང་ དུ་ ཇི་ཙམ་ དུ་ གྱུར་པ ར་ འཕང་ དུ་ འང་ དེ་ཙམ་ དུ་ གྱུར་ ཏེ
en: Imagine that the city reaches as high as it is wide, and that

source: དེ འི་ རབ་ སྲ་ ཞིང་ བརྟན་ ཏེ་ མི་ ཕྱེད་ ལ་ མི་ ཤིགས་པ་ དག་ ཀྱང་ དེ་ཙམ་ དུ་ གྱུར་ ལ །_
en: it is surrounded by a solid, stable, unbreakable, and indestructible wall.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ གྲོང་ཁྱེར་ ཆེན་པོ་ དེ་ཡང་ འདི་ལྟ་སྟེ་ དཔེར་ན །_ |#| འབྲུ འི་ སྣོད་ བྱུར་བུ ར་ གྱུར་པ་ བཞིན་ དུ་ བྱེ་མ ས་ གང་བ ར་ གྱུར་ ན །_
en: Śāradvatī­putra, now imagine if that great city became a granary, full of grains.

source: བྱེ་མ འི་ ཕུང་པོ་ དེ་དག་ ཇི་ཙམ་ དུ་ འགྱུར །_
en: How large would the heap of grains then be?”

source: བདེ་བ ར་ གཤེགས་པ་ གྲངས་ མ་ མཆིས་ ལགས་སོ །_།
en: “Blissful One, it could not be fathomed.”

source: ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ མོས་པ ར་ བྱ །_ |#| [33b] ཁོང་ དུ་ ཆུད་པ ར་ བྱ་ སྟེ །_
en: $184 “Śāradvatī­putra,” |#| “try to imagine and understand this. [33.b]

source: རྩིས་ མཁན་ ནམ །_ རྩིས་ མཁན་ཆེན་པོ་ དག་ གིས་ བྱེ་མ འི་ ཕུང་པོ་ དག་ གི་ ཚད་ གཟུང་བ ར་ ནི་ ནུས་ ཀྱང་ སྲིད་ ཀྱི །_
en: It is in fact possible that some mathematicians, or master mathematicians, could calculate the extent of such a mass of grains.

source: བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ ཐོག་མ་ མངོན་པར་ རྫོགས་པ ར་ སངས་ རྒྱས་ ཏེ་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ དམ་པ་ ན་ བཞུགས་པ་ གང་དག་ མཉེས་པ ར་ བྱས་ ནས |#| བཅོམ་ལྡན་འདས་ ཀྱིས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་ དུ་ གསོལ་ ཞེས་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་པ འི་ དེ་བཞིན་ གཤེགས་པ་ དེ་དག་ གི་ ཚད་ གཟུང་བ ར་ ནི་ མི་ ནུས་ སོ །_།
en: Yet the amount of thus-gone ones, residing on the seats of awakening, to whom the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin has paid worship, invoked, and supplicated to turn the wheel of Dharma when they first attained perfect buddhahood is indeed beyond count.

source: དེ་བ ས་ ཆེས་ མང་བ འི་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ལ་ རིན་པོ་ཆེ་ སྣ་ བདུན་ ལས་ བྱས་པ འི་ ཆོས་ ཀྱི་ འཁོར་ལོ་ དག་ བྱས་ ཏེ་ |#| ཕུལ་བ་ དང་ །_
en: And there are even many more blessed buddhas for whom he has prepared and offered a Dharma wheel made of the seven precious substances.

source: དེ་བ ས་ ཆེས་ མང་བ འི་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ རྣམས་ ལ་ མེ་ཏོག་ གི་ འཁོར་ལོ་ དག་ དང་ །_ སྤོས་ ཀྱི་ འཁོར་ལོ་ དག་ ཕུལ་བ་ ཡང་ རེ་ཞིག་ བླ་ ན་ |#| མེད་པ་ ཡང་ དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ཡོངས་སུ་ མ་ བསྔོས་ ན
en: And again, compared to that amount, there are far more blessed buddhas to whom he has offered a flower wheel or a wheel of incense without having dedicated it to unsurpassable and perfect awakening.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དག་ ལ་ གསེར་དངུལ་ དང་ །_ ཤིང་ ལས་ བྱས་པ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ ཤིན་ཏུ་ བརྒྱན་པ འི་ འཁོར་ལོ་ གཞན་དག་ ཕུལ་བ་ ལྟ་ཅི་ སྨོས་ ཏེ་ འདི་ལྟ་སྟེ །_
en: Why then even mention the exquisitely adorned wheels of gold, silver, and wood that he has offered to the blessed buddhas?

source: སངས་རྒྱས་ བཅོམ་ལྡན་ འདས་ དག་ ལ་ དེ་དག་ དབུལ་བ་ ན་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ བྱ་བ འི་ ཕྱིར་ དང་ །_ ཡང་ དང་ ཡང་ དུ་ གསོལ་བ་ གདབ་པ འི་ ཕྱིར་ ཡོངས་སུ་ བསྔོས་ སོ །_།
en: All such offerings to the blessed buddhas he has dedicated toward the turning of the Dharma wheel, and thus he has supplicated, again and again.

source: དེ འི་ འོག་ ཏུ་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རབ་ ཀྱི་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་པ འི་ ཁྱུ་མཆོག་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ འཇིག་རྟེན་ དུ་ བྱུང་ ངོ་ །_།
en: $185 “There was a time when the thus-gone one, the worthy one, the perfect buddha Royal Leader Treading with Great Strength appeared in the world.

source: དེ འི་ ཚེ་ རྒྱལ་པོ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱིས་ འབར་བ་ ཞེས་ བྱ་བ་ ཞིག་ བྱུང་ སྟེ །_
en: At that time there was a king by the name of Blazing with Famed Power,

source: སྟོང་གསུམ་ གྱི་ སྟོང་ ཆེན་པོ འི་ འཇིག་རྟེན་ གྱི་ ཁམས་ ན་ མི འི་ སྐྱེ་དགུ འི་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ དབང་ཕྱུག་ ལ་ དབང་ བྱེད་ དོ །_།
en: who reigned as a universal emperor within the trichiliocosm.

source: དེ་ གང་ གི་ ཚེ་ བཙུན་མོ འི་ འཁོར་ ཏམ །_ སྐྱེད་མོས་ཚལ་ ན་ འདུག་པ ར་ གྱུར་ ཀྱང་ རུང་ སྟེ །_
en: There, within the retinue of his queens, or residing in his parks, the king would pursue the pleasures of the senses, frolicking and reveling.

source: འདོད་པ འི་ ཡོན་ཏན་ དག་ གིས་ དགའ་བ ར་ འདོད་ དམ །_ རྩེ་བ ར་ འདོད་ དམ །_ དགའ་མགུ ར་ སྤྱོད་པ ར་ འདོད་ ན་ |#| དེ་ ལ་ བཙུན་མོ འི་ འཁོར་ དེ་ |#| གླུ་གར་ དང་ རོལ་མོ་ འདོད་པ་ དང་ ལྡན་པ་ [34a] དག་བྱེད་ ཅིང་ །_ དེ འི་ ཚེ་ དེས་ མི་རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ ཐོས་ སོ །_།
en: Yet one time, as he asked his queens to entertain him with song, dance, and music, [34.a] he instead heard the words of impermanence, suffering, and the absence of self.

source: དེ འི་ ཚེ་ དེ་ འདོད་པ འི་ ཡོན་ཏན་ དག་ ལས་ ཡིད་ བྱུང་བ ར་ གྱུར་ ཏེ །_
en: Immediately the king became disenchanted with his pleasures.

source: མ་ཆགས་པ འི་ ཡིད་ དང་ །_ སྐྲག་པ འི་ ཡིད་ དང་ །_ སྐྱོ་བ འི་ ཡིད་ དང་ ལྡན་པ ས་ དེ་བཞིན་ གཤེགས་པ་ རབ་ ཀྱི་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་པ་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས་
en: Having lost his desire, he became frightened and sad, and in such a frame of mind he went before the thus-gone Royal Leader Treading with Great Strength.

source: བཅོམ་ལྡན་འདས་ དེ འི་ ཞབས་ ལ་མགོ་ བོས་ ཕྱག་ འཚལ་ ཏེ་ |#| ཕྱོགས་ གཅིག་ ཏུ་ འདུག་པ་ དང་ །_ འོངས་པ་ དེ་ ལ་ བཅོམ་ལྡན་འདས་ དེས་ སྔོན་ གྱི་ དགེ་བ འི་ རྩ་བ་ གླེང་བ་ མཛད་ དེ
en: Having bowed his head to the Thus-Gone One’s feet he took a place before him. |#| $186 “Upon the king’s arrival the Blessed One spoke on roots of virtue from the past, and

source: དེས་ དེ་ ཐོས་ ནས་ འདི་ སྙམ་ དུ་ སེམས་ ཏེ །_
en: as the king listened, he thought,

source: དེ་བཞིན་ གཤེགས་པ་ དེ་ ནི་ འདི་ལྟར་ སྒྲིབ་པ་ མི་ མངའ་བ འི་ ཡེ་ཤེས་ གཟིགས་པ་ དང་ ལྡན་ ཏེ །_
en: ‘The Blessed One sees with wisdom free of any obscuration, and

source: བཅོམ་ལྡན་འདས་ དེ་ ནི་ དུས་ དེ་སྲིད་ འདས་ ཀྱང་ དགེ་བ འི་ རྩ་བ་ དག་ ཐུགས་ སུ་ ཆུད་ ཀྱི །_
en: he has realized roots of virtue for so long.

source: བདག་ གིས་ ནི་ དེ་ལས་ དགེ་བ འི་ རྩ་བ་ གཅིག་ ཀྱང་ མི་ ཤེས་ སོ་ སྙམ་ མོ །_།
en: As for myself, compared to him I am not aware of any virtuous roots.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ དེ་སྙེད་ ལ །_ འདོད་པ འི་ ཡོན་ཏན་ གྱི་ སྦག་པ ས་ སྦགས་པ །_ རྒྱལ་སྲིད་ ཀྱི་ སྦག་པ ས་ སྦགས་པ །_ དབང་ཕྱུག་ གིས་ སྦགས་པ་ བདག་ གིས་ དགེ་བ འི་ རྩ་བ་ དག་ བྱས་ ཤིང་ བྱས་ ནས་ |#| ཀྱང་ མངོན་པར་ མི་ ཤེས་ ལ །_
en: Before so many buddhas I have created roots of virtue, yet they were all polluted by the muck of sense pleasures, politics, and power. |#| Thus I did not recognize them, and

source: བྱང་ཆུབ་ ཏུ་ ཡང་ ཡོངས་སུ་ མ་ བསྔོས་ སུ་ ཟིན་ ཀྱང་ གང་ ད་ལྟ ར་ བདག་ དགེ་བ འི་ རྩ་བ་ གང་ ངེས་པ ར་ མངོན་པར་ འདུ་བྱེད་པ་ དེ་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དོན་ དུ་ ཡོངས་སུ་ བསྔོ་བ ར་ གྱུར་ཅིག _།
en: I did not dedicate them to awakening. |#| May all the roots of virtue that I now form be dedicated to the welfare of all beings!

source: གང་དང་གང་ དུ་ སོ་སོ ར་ སྐྱེ་བ་ དང་ །_ གང་དང་གང་ དུ་ སྐྱེ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་དང་གང་ དུ་ འགྲོ་བ ར་ གྱུར་པ་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ དེ་དག་ ལ་ རང་རང་ གི་ སྒྲ་ མངོན་པར་ བརྗོད་པ ས་ སྒྲ་ འབྱིན་པ ར་ གྱུར་ཅིག _།
en: Throughout all places, realms, and buddha realms, may words be spoken in the languages that beings understand, and

source: དེ་ ཐམས་ཅད་ ཀྱང་ སེམས་ཅན་ རྣམས་ ཀྱིས་ མི་རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ ཐོས་པ ར་ གྱུར་ཅིག _།
en: may all beings thus come to hear of impermanence, suffering, and the absence of self.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ དག་ ན་ རྩྭ་ དང་ །_ ནགས་ཚལ་ གང་དག་ ཡོད་པ་ དག་ ཐ་ན་ སོར་ བཞི་ ཙམ་པ་ དག་ ཀྱང་ རུང་ སྟེ །_ |#| ཐམས་ཅད་ ལས་མི་ རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ འབྱུང་བ ར་ གྱུར་ཅིག _།
en: In all worlds, may all plants and trees, even the smallest ones, resound with the words of impermanence, suffering, and the absence of self, and

source: སྒྲ་ དེ་ཡང་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱིས་ ཐོས་པ ར་ གྱུར་ཅིག _།
en: may all beings hear those words.

source: ཚོགས་ ཀྱི་ དགེ་ [34b] བ འི་ རྩ་བ་ དེ་ ཐམས་ཅད་ ཀྱང་ འདི་ལྟ་སྟེ །_ |#| དེ་བཞིན་ གཤེགས་པ་ རབ་ ཀྱི་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་པ འི་ ཁྱུ་མཆོག་ གི་ ཡེ་ཤེས་ ཇི་ འདྲ་བ་ དེ་ལྟ་ བུ འི་ ཐེག་པ་ ཆེན་པོ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ སེམས་ཅན་ ཐམས་ཅད་ དང་ ཐུན་མོང་ དུ་ བྱ འོ་ ཞེས་ རྒྱལ་པོ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱིས་ འབར་བ ས་ དེ་ལྟ ར་ རིག་ ནས་ |#| སྟན་ ལས་ ལངས་ ཏེ་
en: May all accumulated roots of virtue [34.b] cause all beings to equally enter the Great Vehicle with a wisdom that is just like that of the thus-gone Royal Leader Treading with Great Strength.’ |#| $187 “With this understanding King Blazing with Famed Power then rose from his seat.

source: བཅོམ་ལྡན་འདས་ དེ འི་ སྤྱན་སྔ ར་ འདུག་ ནས་ |#| འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Standing before the Blessed One, he said,

source: བཅོམ་ལྡན་འདས་ གང་ དུ་ བདག་དབང་ ཕྱུག་ ལ་ དབང་ བགྱིད་པ འི་ རྣམ་པར་ རྒྱལ་བ་ ན་ བདག་ གི་ བདོག་པ་ གང་ཅི་ ཡང་ རུང་ །_ |#| དེ་ ཐམས་ཅད་ སངས་ རྒྱས་ ལ་སོགས་པ་ འཕགས་པ འི་ དགེ་འདུན་ གྱིས་ ལོངས་ སྤྱད་པ འི་ སླད་ དུ་ ཕུལ་ ལགས་སོ །_།
en: “Blessed One, all of my possessions throughout my entire realm I offer, without exception, to the buddhas and so forth, so that the noble saṅgha may partake of them.”

source: ཕུལ་ ནས་ |#| ཀྱང་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱིས་ འབར་བ་ ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ བྱུང་ སྟེ
en: $188 “Having made this offering, King Blazing with Famed Power then went forth from his household and became a homeless monk.

source: དེ་ རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས་ རྒྱལ་པོ་ དེ འི་ དཔུང་ གི་ ཚོགས་ ཡན་ལག་ བཞི་པ་ ཡང་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: Moreover, as they heard of the king’s going forth all four divisions of the royal army subsequently also went forth.

source: རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས་ རྒྱལ་པོ འི་ བཙུན་མོ འི་ འཁོར་ ལས་ ཁྲག་ཁྲིག་ ཕྲག་ བཞི་ བཅུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: So did the four billion ladies from the royal harem.

source: དེ་དག་ རབ་ཏུ་ བྱུང་བ ར་ རིག་ ནས་ གྲོང་མི་ དང་ །_ ཡུལ་མི་ དག་ ཀྱང་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ ངོ་ །_།
en: Hearing of these goings forth, the townspeople and farmers also went forth.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ མདོར་ན་ ཁྲག་ཁྲིག་ ཕྲག་ བརྒྱད་ཅུ་ རྗེས་སུ་ རབ་ཏུ་ བྱུང་ སྟེ །_
en: Śāradvatī­putra, in short, there were eight billion people who thus went forth and,

source: དེ་དག་ དེ་ལྟ ར་ རབ་ཏུ་ བྱུང་ མ་ ཐག་ ཏུ་ བརྩོན་འགྲུས་ བརྩམས་པ ས་ གནས་ སོ །_།
en: as soon as they had done so, they practiced diligently.

source: དགེ་བ འི་ ཆོས་ ཡོངས་སུ་ ཚོལ་བ་ ལ་ མངོན་པར་ བརྩོན་པ ས་ དེ་དག་ རིང་པོ་ མ་ཐོགས་པ་ ཉིད་ དུ་ མངོན་པར་ ཤེས་པ་ ལྔ་སྐྱེས་ སོ །_།
en: $189 “Thus, as they all fervently pursued virtuous qualities, it did not take them long to acquire the five superknowledges.

source: དེ་དག་ རང་ གི་ མངོན་པར་ ཤེས་པ་ དང་ །_ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ དང་ །_ ལུས་ དེ་ཉིད་ དང་ །_ སྐྱེ་བ་ དེ་ཉིད་ ཀྱིས་ ཤར་ཕྱོགས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་ག འི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ཏུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ལ་ བཅོམ་ལྡན་འདས་ ཆོས་ བསྟན་ དུ་ གསོལ །_ |#| བདེ་བ ར་ གཤེགས་པ་ ཆོས་ བསྟན་ དུ་ གསོལ་ ཞེས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་བོ །_།
en: In that very life and body they all became able to travel by the power of their superknowledges and miraculous abilities. |#| Traveling east in this way they visited as many buddha realms as there are grains of sand in the river Ganges and met as many buddhas. |#| Before each of them they prayed, ‘Blessed One, please teach the Dharma. |#| Blissful One, please turn the wheel of Dharma.’

source: དེ་བཞིན་ དུ་ ལྷོ་ཕྱོགས་ དང་ །_ ནུབ་ཕྱོགས་ དང་ །_ བྱང་ཕྱོགས་ དང་ །_ སྟེང་ གི་ ཕྱོགས་ དང་ །_ དེ་བཞིན་ དུ་ འོག་ གི་ ཕྱོགས་ དང་ །_ དེ་བཞིན་ དུ་ ཕྱོགས་ [35a] མཚམས་ རྣམས་ སུ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ཏུ་ སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ལ་ བཅོམ་ལྡན་འདས་ ཆོས་ བསྟན་ དུ་ གསོལ །_ |#| བདེ་བ ར་ གཤེགས་པ་ ཆོས་ བསྟན་ དུ་ གསོལ་ ཞེས་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་བོ །_
en: In that same way they also traveled to the south, west, and north, as well as above and below, and in [35.a] all the intermediate directions. |#| In each of those directions they visited as many buddha realms as there are grains of sand in the river Ganges and supplicated as many buddhas, ‘Blessed One, please teach the Dharma. |#| Blissful One, please turn the wheel of Dharma.’

source: དེ་ ཕྱིན་ཆད་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱིས་ འབར་བ་ དེ་ སངས་རྒྱས་ ཀྱི་ ཞིང་ ཡོངས་སུ་ མ་ དག་པ ར་ ནམ་ཡང་ མ་ སྐྱེས་ ཤིང་ མངལ་ དུ་ སྐྱེ་བ་ ནམ་ཡང་ ཡོངས་སུ་ མ་ བཟུང་ ངོ་ །_།
en: $190 “Since then the bodhisattva great being Blazing with Famed Power has never been born in an impure buddha realm, nor has he ever taken birth from a womb.

source: སངས་རྒྱས་ ཀྱི་ ཞིང་ གང་དང་གང་ དུ་ སོང་བ འི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ ཡལ་ག འམ །_ འདབ་མ འམ །_ ལོ་མ འམ །_ ཤིང་ ལྗོན་པ འམ །_ ནགས་ཚལ་ གང་དག་ ཡོད་པ་ དེ་དག་ ཐམས་ཅད་ ལས་མི་ རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ སྟོང་པ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ དག་ གྲག་ གོ །_།
en: Whenever he visits a buddha realm, all the branches, petals, leaves, trees, and forests within that buddha realm will speak of impermanence, suffering, emptiness, and the absence of self.

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་དག་ ན་ སེམས་ཅན་ གང་དག་ འཁོད་པ་ དེ་དག་ ཀྱང་ དེ འི་ ཚེ་ རང་རང་ གི་ སྒྲ་ རབ་ཏུ་ བརྗོད་ དེ །_ |#| ཕན་ཚུན་ སྒྲ་ ཐོས་ ཤིང་ མི་རྟག་པ་ དང་ །_ སྡུག་བསྔལ་བ་ དང་ །_ བདག་མེད་པ འི་ སྒྲ་ ཐོས་ སོ །_།
en: Likewise, in all the worlds that he visits, sentient beings will understand each other’s languages, and they will hear the words of impermanence, suffering, and the absence of self.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ འི་ ཚེ་ དེ འི་ དུས་ ན་ དེ་བཞིན་ གཤེགས་པ་ རབ་ ཀྱི་ རྩལ་ གྱིས་ རྣམ་པར་ གནོན་པ འི་ ཁྱུ་མཆོག་ རྒྱལ་པོ་ དེ་ལས་ སྔོན་ གྱི་ ཚོགས་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ ཐོས་ ནས་ |#| ཁྱིམ་ ནས་ ཁྱིམ་ མེད་པར་ རབ་ཏུ་ བྱུང་ སྟེ
en: $191 “Thus it was, Śāradvatī­putra, that the universal emperor Blazing with Famed Power once heard the thus-gone Royal Leader Treading with Great Strength teaching on past roots of virtue, and so decided to leave his household to become a homeless monk.

source: དགེ་བ འི་ རྩ་བ་ དེ་ཡང་ སེམས་ཅན་ ཐམས་ཅད་ དང་ ཐུན་མོང་ དུ་ བྱས་ ནས་
en: Sharing his roots of virtue with all beings,

source: བླ་ ན་ |#| མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ ཆུབ་ ཏུ་ ཡོངས་སུ་ བསྔོས་ ཤིང་ ལུས་ ཐོབ་པ་ དེས་ ཀྱང་ མངོན་པར་ ཤེས་པ་ རྣམས་ སོ་སོ ར་ ཐོབ་ ལ །_ ཏིང་ངེ་འཛིན་ གྱི་ སྟོབས་ བསྐྱེད་པ ས་ ཀྱང་ ཤར་ཕྱོགས་ སུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ཏུ་ སོང་ ནས
en: he dedicated them toward unexcelled and perfect awakening. |#| Within that very same body he developed the superknowledges and the power of absorption, and so he journeyed to the east, visiting as many buddha realms as there are grains of sand in the river Ganges.

source: སངས་རྒྱས་ བཅོམ་ལྡན་འདས་ བྱང་ཆུབ་ ཀྱི་ སྙིང་པོ་ དམ་པ་ ན་ བཞུགས་པ་ གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ དག་ ལ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ར་ བསྐུལ་ ཅིང་ གསོལ་བ་ བཏབ་ ལ །_
en: Visiting as many blessed buddhas, he stood before them, as they resided upon their sacred seat of awakening, invoking and supplicating them to turn the wheel of Dharma.

source: དེ་བཞིན་ དུ་ ཕྱོགས་ བཅུ་ ཐམས་ཅད་ དུ་ སོང་ ནས་
en: Indeed, in this way he traveled in all the ten directions.

source: རྒྱས་པ ར་ བྱས་པ འི་ འཁོར་ལོ ས་ སྒྱུར་བ འི་ རྒྱལ་པོ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱིས་ འབར་བ་ ཞེས་ [35b] བྱ་བ་ དེ་ གཞན་ ཞིག་ ཡིན་པ་ སྙམ་ དུ་ སེམས་ ན །_ |#| ཤ་ར་དྭ་ཏི འི་ བུ་ ཁྱོད་ ཀྱིས་ དེ་ལྟ ར་ བལྟ་བ ར་ མི་ བྱ་ སྟེ །_
en: Now, Śāradvatī­putra, you should not think that the universal emperor Blazing with Famed Power [35.b] was someone else.

source: ཤ་ར་དྭ་ཏི འི་ བུ་ དེ་ ནི་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ འདི་ ཡིན་ ནོ །_།
en: Because, Śāradvatī­putra, he is none other than the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin.”

source: དེ་ནས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་ པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ རྒྱལ་པོ འི་ ཁབ་ ཀྱི་ གྲོང་ཁྱེར་ ཆེན་པོ་ ག་ལ་བ་ དང་ །_ འོད་མ འི་ ཚལ་ བྱ་ ཀ་ ལན་ ད་ ཀ་ གནས་པ་ ག་ལ་བ་ དང་ །_ བཅོམ་ལྡན་འདས་ ག་ལ་བ་ དེར་ སོང་ སྟེ་ |#| ཕྱིན་ ནས
en: $192 The bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin then proceeded to the city of Rājagṛha and to the Kalandaka­nivāpa in the Veṇuvana where the Blessed One was residing. |#| Going before him,

source: ཕྱོགས་ གཅིག་ ཏུ་ འདུག་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: Then he addressed the Blessed One with the following words:

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མཚན་ མ་ མེད་པ འི་ ང་རོ་ བཅོམ་ལྡན་འདས་ ལ་ གནོད་པ་ ཆུང་ ངམ །_ ཉམ་ང་བ་ ཉུང་ ངམ །_ བསྐྱོད་པ་ ཡང་ ངམ །_ སྟོབས་ དང་ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ་ ཞེས་ སྙུན་ གསོལ་ ཞིང་ །_
en: “Blessed One, the blessed thus-gone Roar of Signlessness inquires whether you have encountered but little hardship and discomfort, and whether you remain healthy, strong, and at ease.

source: བཅོམ་ལྡན་འདས་ དེས་ པད་མ་ ཆེན་པོ་ འདི་ ཡང་ བསྐུར་བ་ ལགས་ ན་ བཅོམ་ལྡན་འདས་ བཞེས་ སུ་ གསོལ །_
en: And he also sends you this great lotus flower, which I request you to accept.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལས་ པད་མ་ ཆེན་པོ་ དེ་ བཞེས་ ཏེ །_ |#| བཞེས་ ནས་ ཀྱང་ བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་དཔའ་ ཆེན་པོ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $193 At this point the Blessed One accepted the lotus flower from the bodhisattva great being Saha­cittotpāda­dharma­cakra­pravartin and then said to him,

source: རིགས་ ཀྱི་ བུ་ ཅི་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མཚན་མ་ མེད་པ འི་ ང་རོ་ དེ་ སྟོབས་ དང་ ལྡན་ ནམ །_ བསྙུན་ མི་ མངའ་ འམ །_ འགྱུར་བ་ མི་ མངའ་ འམ །_ བདེ་བ ར་ རེག་པ་ ལ་ གནས་ སམ །_
en: “Noble son, does the blessed thus-gone Roar of Signlessness remain strong, healthy, unchanged, and happy within his buddha realm?”

source: བཅོམ་ལྡན་འདས་ དེ་བཞིན་ གཤེགས་པ་ མཚན་མ་ མེད་པ འི་ ང་རོ་ དེ་ སྟོབས་ དང་ ལྡན་ ཞིང་ བསྙུན་ མི་ མངའ་ ལ་ འགྱུར་བ་ མི་ མངའ་ སྟེ |#| བདེ་བ ར་ རེག་པ་ ལ་ གནས་ ལགས་སོ །_།
en: $194 “Blessed One,” answered the bodhisattva great being, “the thus-gone Roar of Signlessness remains strong, healthy, unchanged, and happy.

source: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེར་ ནི་ འདི་ ལྟ་ [36a] སྟེ །_ |#| གསུམ་ ཡོངས་སུ་ དག་པ་ དང་ ལྡན་པ འི་ སེམས་ཅན་ ཡོངས་སུ་ དག་པ་ དག་ འདུས་ ལགས་ ཏེ །_
en: Because, Blessed One, in that buddha realm [36.a] pure beings assemble, who are endowed with three factors of purity.

source: གསུམ་པོ་ གང་ཞེ་ན །_
en: What are those three factors?

source: བདེན་པ ར་ ཡོངས་སུ་ བསྔོ་བ འི་ ཕྱིར་ དགེ་བ འི་ རྩ་བ་ ཡོངས་སུ་ དག་པ་ དང་ །_ སྨོན་ལམ་ གྱིས་ ཚུལ་ཁྲིམས་ ཚད་མ་ མཆིས་ པ་ ཡོངས་སུ་ དག་པ་ དང་ །_ ཆོས་ ཐམས་ཅད་ མི་ དམིགས་པ འི་ ལྷག་མཐོང་ གིས་ ཡོངས་སུ་ བསྔོ་བ འི་ ཕྱིར་ ལྟ་བ་ ཚད་མ་ མཆིས་པ་ ཡོངས་སུ་ དག་པ འོ །_།
en: Pure roots of virtue as they are dedicated to the truth, pure boundless discipline due to aspirations, and pure boundless view due to dedication by means of special insight that is not fixed on any phenomenon.

source: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ཚུལ་ ཁྲིམས་ ཉམས་པ འམ །_ ལྟ་བ་ ཉམས་པ འམ །_ ཆོ་ག་ ཉམས་པ འི་ སེམས་ཅན་ གང་ཡང་ མ་ མཆིས་ ལགས་སོ །_།
en: Blessed One, in that buddha realm there is not a single being who has a corrupted discipline, view, or comportment.

source: བཅོམ་ལྡན་འདས་ སངས་རྒྱས་ ཀྱི་ ཞིང་ དེ་ ན་ ཉམས་པ་ གསུམ་པོ་ དག་ གི་ མིང་ ཡང་ མི་ གདའ་ ལགས་སོ །_།
en: Blessed One, in that buddha realm even the terms for such flaws do not exist.

source: བཅོམ་ལྡན་འདས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེ་ལས་ བརྩམས་ ན་ |#| མི་མཇེད་ ཀྱི་ འཇིག་རྟེན་ གྱི་ ཁམས་ འདི་ ནི་ དགུམ་པ འི་ རིབ་མ་ དང་ འདྲ་ སྟེ |#| གཅིག་ ལ་ གཅིག་ འགུམས་པ ར་ བགྱིད་པ་ ལགས་ ཀྱིས །_
en: Compared to that world, Blessed One, this world known as Enduring is like a prison filled with murderers, where people are constantly killing each other.

source: བཅོམ་ལྡན་འདས་ ཚུ ར་ གཤེགས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ གཤེགས་ སོ །_།
en: Come, Blessed One. |#| Come along to that other world.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ལ་ འདི་སྐད་ ཅེས་ བཀའ་ སྩལ་ ཏོ །_།
en: $195 In response the Blessed One said to the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin,

source: རིགས་ ཀྱི་ བུ་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ ཅི་ཞིག་ བྱ་ སྟེ །_
en: “Noble son, why would I go to that world?

source: འཇིག་རྟེན་ གྱི་ ཁམས་ མི་མཇེད་ འདི་ཉིད་ དུ་ སེམས་ཅན་ རྣམས་ ལ་ ཆོས་ བསྟན་པ ས་ ཆོག་ གོ །_།
en: It is fine to stay in this world, teaching the Dharma to beings here.”

source: བཅོམ་ལྡན་འདས་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ ས་ ལན་ གཉིས་ སུ་ ཡང་ འདི་སྐད་ ཅེས་ གསོལ་ ཏོ །_།
en: $196 Once more the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin called on the Blessed One:

source: འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ གལ་ཏེ་ བཅོམ་ལྡན་འདས་ མི་ གཤེགས་ ན་ |#| ནི་ བདག་ གིས་ རང་ གི་ རྫུ་འཕྲུལ་ གྱི་ སྟོབས་ དང་ །_ སེམས་ ཀྱི་ སྨོན་ལམ་ གྱི་ མཐུ ས་ འཇིག་རྟེན་ གྱིས་ ཁམས་ འདི་ སུག་པ ར་ བཞག་ སྟེ
en: If, Blessed One, you decline to come along I shall pull you there by the power of my own miraculous abilities and the force of my aspirations.

source: ནམ་མཁའ་ ལས་ འཇིག་རྟེན་ གྱི་ ཁམས་ དེར་ གཞག་ པར་ བགྱི འོ །_།
en: I shall take you through space and into that world.”

source: བཅོམ་ལྡན་འདས་ ཀྱིས་ བྱང་ཆུབ་ སེམས་དཔའ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ འི་ མཐུ་ [36b] ཡང་དག་ པར་ བསྟན་པ འི་ ཕྱིར་ དང་ །_ སེམས་ཅན་ རྣམས་ ཀྱི་ དགེ་བ འི་ རྩ་བ་ ཡང་དག་ པར་ བསྐྱེད་པ འི་ ཕྱིར་ དང་ །_ ཡིད་ དང་བ ར་ བྱ་བ འི་ ཕྱིར་ བཏང་སྙོམས་ སུ་ མཛད་ དོ །_།
en: $197 So that the bodhisattva Saha­cittotpāda­dharma­cakra­pravartin’s powers would be known, [36.b] and so that sentient beings would engender roots of virtue and become inspired, the Blessed One at this point remained indifferent.
